# GetProfiles Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FootPrintRoof..::..GetProfiles Method
FootPrintRoof Class See Also
---
Retrieve all the curveLoops of FootPrintRoof.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ModelCurveArrArray GetProfiles()
```

Visual Basic
---
```text
Public Function GetProfiles As ModelCurveArrArray
```

Visual C++
---
```text
public:
ModelCurveArrArray^ GetProfiles()
```

# See Also
FootPrintRoof Class
Autodesk.Revit.DB Namespace